
## :white_check_mark: Apply Succeeded (shared-snowplow-consumer-cdk)

[CI link](https://circleci.com/gh/Pocket/pocket-monorepo/56059)



<pre><code>Apply complete! Resources: 2 added, 0 changed, 1 destroyed.</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.terraform_remote_state.incident_management: Reading...
data.aws_route53_zone.shared-snowplow-consumer-app_application_base_dns_main_hosted_zone_EA88CD39: Reading...
aws_sns_topic.pagerduty_alarm-non-critical-topic_53C1A3B3: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:SharedSnowplowConsumer-Prod-Infrastructure-Alarm-Non-Critical]
aws_cloudwatch_log_group.shared-snowplow-consumer-app_aws-otel-collector-log-group_408C8F4B: Refreshing state... [id=/Backend/SharedSnowplowConsumer-Prod/ecs/aws-otel-collector]
aws_sqs_queue.shared-event-consumer: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue]
data.aws_kms_alias.kms_alias: Reading...
aws_ecs_cluster.shared-snowplow-consumer-app_application_ecs_cluster_E189522B: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:cluster/SharedSnowplowConsumer-Prod]
aws_acm_certificate.shared-snowplow-consumer-app_application_alb_certificate_7A543611: Refreshing state... [id=arn:aws:acm:us-east-1:996905175585:certificate/672aa563-fb1b-4aa7-aa89-14637b9588e5]
data.aws_caller_identity.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_current_account_388FE51A: Reading...
data.aws_caller_identity.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_current_account_388FE51A: Read complete after 0s [id=996905175585]
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_vpc_ssm_param_7FC9719C: Reading...
data.aws_sns_topic.backend_notifications: Reading...
data.aws_kms_alias.kms_alias: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
data.aws_region.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_current_region_46D68E2A: Reading...
data.aws_region.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_current_region_46D68E2A: Read complete after 0s [id=us-east-1]
aws_sqs_queue.sns-topic-dlq: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SNS-Topics-DLQ]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_CB3573F8: Reading...
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_vpc_ssm_param_7FC9719C: Read complete after 0s [id=/Shared/Vpc]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_codedeploy_assume_role_CB3573F8: Read complete after 0s [id=4250039221]
data.aws_sns_topic.backend_notifications: Read complete after 0s [id=arn:aws:sns:us-east-1:996905175585:Backend-Prod-ChatBot]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-assume_898B3E93: Reading...
aws_sns_topic.pagerduty_alarm-critical-topic_F1534579: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:SharedSnowplowConsumer-Prod-Infrastructure-Alarm-Critical]
aws_ecr_repository.shared-snowplow-consumer-app_application_ecs_service_ecr-app_ecr-repo_C47DCC29: Refreshing state... [id=sharedsnowplowconsumer-prod-app]
data.aws_caller_identity.shared-snowplow-consumer-app_application_pocket_vpc_current_identity_AAE4891A: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-assume_898B3E93: Read complete after 0s [id=1077804475]
data.aws_caller_identity.caller: Reading...
data.aws_caller_identity.shared-snowplow-consumer-app_application_pocket_vpc_current_identity_AAE4891A: Read complete after 0s [id=996905175585]
data.aws_kms_alias.shared-snowplow-consumer-app_application_pocket_vpc_secrets_manager_key_901EECFD: Reading...
data.aws_region.region: Reading...
aws_codedeploy_app.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_8FE8F303: Refreshing state... [id=243c397d-021a-42f4-a04f-d7864817ceb8:SharedSnowplowConsumer-Prod-ECS]
data.aws_caller_identity.caller: Read complete after 0s [id=996905175585]
data.aws_region.region: Read complete after 0s [id=us-east-1]
data.aws_region.shared-snowplow-consumer-app_application_pocket_vpc_current_region_9631710E: Reading...
data.aws_kms_alias.shared-snowplow-consumer-app_application_pocket_vpc_secrets_manager_key_901EECFD: Read complete after 0s [id=arn:aws:kms:us-east-1:996905175585:alias/aws/secretsmanager]
aws_cloudwatch_log_group.shared-snowplow-consumer-app_app-log-group_3D66A20E: Refreshing state... [id=/Backend/SharedSnowplowConsumer-Prod/ecs/app]
data.aws_region.shared-snowplow-consumer-app_application_pocket_vpc_current_region_9631710E: Read complete after 0s [id=us-east-1]
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_public_subnets_7BC49E7E: Reading...
aws_route53_zone.shared-snowplow-consumer-app_application_base_dns_subhosted_zone_F2BF377F: Refreshing state... [id=Z0470499THTB5VRUO07I]
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_private_subnets_3023DDDD: Reading...
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_public_subnets_7BC49E7E: Read complete after 0s [id=/Shared/PublicSubnets]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_0662E1E4: Reading...
aws_iam_role.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_code_deploy_role_9A411340: Refreshing state... [id=SharedSnowplowConsumer-Prod-ECSCodeDeployRole]
data.aws_vpc.shared-snowplow-consumer-app_application_pocket_vpc_669183F3: Reading...
data.aws_route53_zone.shared-snowplow-consumer-app_application_base_dns_main_hosted_zone_EA88CD39: Read complete after 0s [id=Z2BHWTOWFVNW3M]
data.aws_ssm_parameter.shared-snowplow-consumer-app_application_pocket_vpc_private_subnets_3023DDDD: Read complete after 0s [id=/Shared/PrivateSubnets]
aws_sns_topic_subscription.ShareableListItemEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListItemEventTopic:000b6051-9a41-4565-871b-4b33adf5d7ea]
aws_cloudwatch_metric_alarm.sharedsnowplowconsumer-prod-dlq-alarm: Refreshing state... [id=SharedSnowplowConsumer-Prod-SharedSnowplowConsumer-Prod-Dlq-Alarm]
aws_iam_role.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-execution-role_CD87AD67: Refreshing state... [id=SharedSnowplowConsumer-Prod-TaskExecutionRole]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-role-policy_0662E1E4: Read complete after 0s [id=1103004003]
data.aws_iam_policy_document.shared-snowplow-consumer-sns-dlq-policy-document: Reading...
aws_iam_role.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role_6BFBDB3C: Refreshing state... [id=SharedSnowplowConsumer-Prod-TaskRole]
data.aws_iam_policy_document.shared-snowplow-consumer-sns-dlq-policy-document: Read complete after 0s [id=697511278]
aws_sns_topic_subscription.CollectionEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-CollectionEventTopic:918ce650-bbc0-4387-9ec6-e1d2d7b022a1]
data.aws_iam_policy_document.shared-snowplow-consumer-sns-sqs-policy-document: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-sns-sqs-policy-document: Read complete after 0s [id=3636265580]
aws_sns_topic_subscription.UserEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-UserEventTopic:f1cb7068-6943-4a28-bea3-5417eb5c3988]
aws_sns_topic_subscription.ProspectEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ProspectEventTopic:3ba5a3a0-3bf8-4630-a1d5-d0f3b2f822ba]
data.terraform_remote_state.incident_management: Read complete after 0s
aws_sns_topic_subscription.ShareableListEventTopic-sns-subscription: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:PocketEventBridge-Prod-ShareableListEventTopic:882bb679-9adb-43a7-8c14-0a4e0fc37321]
aws_ecr_lifecycle_policy.shared-snowplow-consumer-app_application_ecs_service_ecr-app_ecr-repo-lifecyclepolicy_5A709DFD: Refreshing state... [id=sharedsnowplowconsumer-prod-app]
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_FB68591B: Reading...
data.aws_iam_policy_document.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_data-ecs-task-execution-role-policy_FB68591B: Read complete after 0s [id=2238248227]
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Reading...
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Reading...
aws_route53_record.shared-snowplow-consumer-app_application_base_dns_subhosted_zone_ns_A5A92F9C: Refreshing state... [id=Z2BHWTOWFVNW3M_shared-snowplow-consumer.readitlater.com_NS]
aws_iam_policy.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-role-policy_10D31114: Refreshing state... [id=arn:aws:iam::996905175585:policy/SharedSnowplowConsumer-Prod-TaskRolePolicy]
aws_sqs_queue_policy.shared-snowplow-consumer-sns-dlq-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SNS-Topics-DLQ]
aws_sqs_queue_policy.shared-snowplow-consumer-sns-sqs-policy: Refreshing state... [id=https://sqs.us-east-1.amazonaws.com/996905175585/SharedSnowplowConsumer-Prod-SharedEventConsumer-Queue]
pagerduty_service.pagerduty_pagerduty-non-critical_B4CB3938: Refreshing state... [id=P60XOGN]
aws_route53_record.shared-snowplow-consumer-app_application_alb_certificate_certificate_record_FA5168A0: Refreshing state... [id=Z0470499THTB5VRUO07I__8b2e5ac9733cedf259acfa2c23aaec8f.shared-snowplow-consumer.readitlater.com._CNAME]
pagerduty_service.pagerduty_pagerduty-critical_464EE7CD: Refreshing state... [id=P9ZIPVA]
aws_iam_policy.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-execution-role-policy_A2B67C8A: Refreshing state... [id=arn:aws:iam::996905175585:policy/SharedSnowplowConsumer-Prod-TaskExecutionRolePolicy]
aws_codestarnotifications_notification_rule.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_notifications_67DBFB5C: Refreshing state... [id=arn:aws:codestar-notifications:us-east-1:996905175585:notificationrule/b5e72e15bf8f173e86f48eb03fd3984f708f58fc]
aws_iam_role_policy_attachment.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-execution-default-attachment_D76A238C: Refreshing state... [id=SharedSnowplowConsumer-Prod-TaskExecutionRole-20230717221743847800000001]
aws_iam_role_policy_attachment.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_role_attachment_740EA775: Refreshing state... [id=SharedSnowplowConsumer-Prod-ECSCodeDeployRole-20230717221745178600000003]
data.aws_vpc.shared-snowplow-consumer-app_application_pocket_vpc_669183F3: Read complete after 0s [id=vpc-867638e3]
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Refreshing state... [id=SharedSnowplowConsumer-Prod]
aws_iam_role_policy_attachment.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-execution-custom-attachment_6610BEED: Refreshing state... [id=SharedSnowplowConsumer-Prod-TaskExecutionRole-20230717221743914900000002]
aws_iam_role_policy_attachment.shared-snowplow-consumer-app_application_ecs_service_ecs-iam_ecs-task-custom-attachment_0CF1CAB2: Refreshing state... [id=SharedSnowplowConsumer-Prod-TaskRole-20230717221851181000000004]
data.aws_subnets.shared-snowplow-consumer-app_application_pocket_vpc_private_subnet_ids_2E64E66B: Reading...
aws_alb_target_group.shared-snowplow-consumer-app_application_ecs_service_blue_target_group_ecs_target_group_13867750: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/SSPCbl20230717165003981500000006/cff7a8703da07407]
aws_security_group.shared-snowplow-consumer-app_application_application_load_balancer_alb_security_group_0793B1C8: Refreshing state... [id=sg-084b37a1df95f31e0]
aws_alb_target_group.shared-snowplow-consumer-app_application_ecs_service_green_target_group_ecs_target_group_BFDC5A80: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:targetgroup/SSPCgr20230717165003979600000005/e2e36403db4a9c41]
data.aws_subnets.shared-snowplow-consumer-app_application_pocket_vpc_public_subnet_ids_0F6380BA: Reading...
data.aws_subnets.shared-snowplow-consumer-app_application_pocket_vpc_private_subnet_ids_2E64E66B: Read complete after 0s [id=us-east-1]
data.aws_security_groups.shared-snowplow-consumer-app_application_pocket_vpc_default_security_groups_B7959268: Reading...
data.pagerduty_vendor.pagerduty_cloudwatch_7956692A: Read complete after 1s [id=PZQ6AUS]
data.aws_security_groups.shared-snowplow-consumer-app_application_pocket_vpc_internal_security_groups_B160376D: Reading...
data.aws_subnets.shared-snowplow-consumer-app_application_pocket_vpc_public_subnet_ids_0F6380BA: Read complete after 0s [id=us-east-1]
aws_acm_certificate_validation.shared-snowplow-consumer-app_application_alb_certificate_certificate_validation_0A8F4C89: Refreshing state... [id=2023-07-17 16:50:23.039 +0000 UTC]
data.aws_security_groups.shared-snowplow-consumer-app_application_pocket_vpc_default_security_groups_B7959268: Read complete after 0s [id=us-east-1]
local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9: Refreshing state... [id=b7253dda4e8f09875a70e45791d9e53304f5183c]
aws_alb.shared-snowplow-consumer-app_application_application_load_balancer_alb_FFECA3E0: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:loadbalancer/app/SSPC20230717165005209900000008/9d245aae59b778e9]
aws_security_group.shared-snowplow-consumer-app_application_ecs_service_ecs_security_group_7774AE75: Refreshing state... [id=sg-09aca186685ddd1e4]
data.aws_security_groups.shared-snowplow-consumer-app_application_pocket_vpc_internal_security_groups_B160376D: Read complete after 0s [id=us-east-1]
data.pagerduty_vendor.pagerduty_sentry_FFB12B7C: Read complete after 1s [id=PKAPG94]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-critical_45BF6D23: Refreshing state... [id=PSIFF2P]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-critical_546FC7B5: Refreshing state... [id=PWV3FEC]
pagerduty_service_integration.pagerduty_pagerduty_sentry_FFB12B7C-non-critical_B7B95197: Refreshing state... [id=PP9UEPM]
pagerduty_service_integration.pagerduty_pagerduty_cloudwatch_7956692A-non-critical_EFA67B2C: Refreshing state... [id=P8A6DAZ]
aws_alb_listener.shared-snowplow-consumer-app_application_listener_http_78D658C8: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/SSPC20230717165005209900000008/9d245aae59b778e9/a0f3461092c95bec]
aws_route53_record.shared-snowplow-consumer-app_application_alb_record_9558B043: Refreshing state... [id=Z0470499THTB5VRUO07I_shared-snowplow-consumer.readitlater.com_A_1]
aws_cloudwatch_metric_alarm.shared-snowplow-consumer-app_application_alarm-httptarget5xxerrorrate_802C465E: Refreshing state... [id=SharedSnowplowConsumer-Prod-Alarm-HTTPTarget5xxErrorRate]
aws_alb_listener.shared-snowplow-consumer-app_application_listener_https_D2F12616: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener/app/SSPC20230717165005209900000008/9d245aae59b778e9/34f35abddad4d14f]
aws_sns_topic_subscription.pagerduty_alarm-critical-subscription_E2168B84: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:SharedSnowplowConsumer-Prod-Infrastructure-Alarm-Critical:a5735df1-1aaf-401a-8ded-591a8bc479af]
aws_sns_topic_subscription.pagerduty_alarm-non-critical-subscription_4702677B: Refreshing state... [id=arn:aws:sns:us-east-1:996905175585:SharedSnowplowConsumer-Prod-Infrastructure-Alarm-Non-Critical:8bc8c700-b0f8-4ec6-a8be-6f342f17f2e6]
aws_alb_listener_rule.shared-snowplow-consumer-app_application_ecs_service_listener_rule_42D25C4D: Refreshing state... [id=arn:aws:elasticloadbalancing:us-east-1:996905175585:listener-rule/app/SSPC20230717165005209900000008/9d245aae59b778e9/34f35abddad4d14f/d139c5ef08cde8ff]
aws_ecs_service.shared-snowplow-consumer-app_application_ecs_service_ecs-service_4DE3767A: Refreshing state... [id=arn:aws:ecs:us-east-1:996905175585:service/SharedSnowplowConsumer-Prod/SharedSnowplowConsumer-Prod]
aws_appautoscaling_target.shared-snowplow-consumer-app_application_autoscaling_autoscaling_target_E0F1D1EF: Refreshing state... [id=service/SharedSnowplowConsumer-Prod/SharedSnowplowConsumer-Prod]
aws_cloudwatch_dashboard.shared-snowplow-consumer-app_application_cloudwatch-dashboard_8DFBB8D3: Refreshing state... [id=SharedSnowplowConsumer-Prod]
aws_codedeploy_deployment_group.shared-snowplow-consumer-app_application_ecs_service_ecs_codedeploy_ecs_codedeploy_deployment_group_6E78E722: Refreshing state... [id=8fd9e6ba-b2ba-46d6-85bb-e09ec100a27e]
aws_appautoscaling_policy.shared-snowplow-consumer-app_application_autoscaling_scale_in_policy_5FED7B33: Refreshing state... [id=SharedSnowplowConsumer-Prod-ScaleInPolicy]
aws_appautoscaling_policy.shared-snowplow-consumer-app_application_autoscaling_scale_out_policy_43437361: Refreshing state... [id=SharedSnowplowConsumer-Prod-ScaleOutPolicy]
aws_cloudwatch_metric_alarm.shared-snowplow-consumer-app_application_autoscaling_scale_in_alarm_A2935CCC: Refreshing state... [id=SharedSnowplowConsumer-Prod Service Low CPU]
aws_cloudwatch_metric_alarm.shared-snowplow-consumer-app_application_autoscaling_scale_out_alarm_EFA0BDC3: Refreshing state... [id=SharedSnowplowConsumer-Prod Service High CPU]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B must be replaced
-/+ resource "aws_ecs_task_definition" "shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B" {
      ~ arn                      = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharedSnowplowConsumer-Prod:139" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-east-1:996905175585:task-definition/SharedSnowplowConsumer-Prod" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "996905175585.dkr.ecr.us-east-1.amazonaws.com/sharedsnowplowconsumer-prod-app:9984904da8dff6a9335b476efc58b83fa101946d" -> "996905175585.dkr.ecr.us-east-1.amazonaws.com/sharedsnowplowconsumer-prod-app:b5d67996f0e914332f656a15ba3f3a4429c3065e"
                    name                   = "app"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (9 unchanged attributes hidden)
                },
              ~ {
                    name                   = "aws-otel-collector"
                  ~ portMappings           = [
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                      ~ {
                          - protocol      = "tcp"
                            # (2 unchanged attributes hidden)
                        },
                    ]
                    # (10 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "SharedSnowplowConsumer-Prod" -> (known after apply)
      ~ revision                 = 139 -> (known after apply)
        tags                     = {
            "environment" = "Prod"
            "service"     = "SharedSnowplowConsumer"
        }
        # (10 unchanged attributes hidden)
    }

  # local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9 will be created
  + resource "local_file" "shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9" {
      + content              = (known after apply)
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "appspec.json"
      + id                   = (known after apply)
    }

Plan: 2 to add, 0 to change, 1 to destroy.
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Destroying... [id=SharedSnowplowConsumer-Prod]
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Destruction complete after 0s
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Creating...
aws_ecs_task_definition.shared-snowplow-consumer-app_application_ecs_service_ecs-task_6958091B: Creation complete after 1s [id=SharedSnowplowConsumer-Prod]
local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9: Creating...
local_file.shared-snowplow-consumer-app_application_ecs_service_appspec_7674CFF9: Creation complete after 0s [id=c92917a15a6c1219d77d20fdcc8ae2b8d14aba7f]

Apply complete! Resources: 2 added, 0 changed, 1 destroyed.

```

</details>

<!-- github-comment: {"Command":"apply","JobID":"d1204a0d-b490-4f16-9522-c3bd9d606b74","JobName":"shared-snowplow-consumer_infrastructure_apply_prod","PRNumber":196,"Program":"tfcmt","SHA1":"b5d67996f0e914332f656a15ba3f3a4429c3065e","Target":"shared-snowplow-consumer-cdk","Vars":{}} -->